Revit 2027 API
PreviewControl Class
 Presents a preview control to browse the Revit model.
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Autodesk.Revit.UI.PreviewControl
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PreviewControl : UserControl,
	IDisposable
Public Class PreviewControl
	Inherits UserControl
	Implements IDisposable
public ref class PreviewControl : public UserControl,
	IDisposable
type PreviewControl =
    class
        inherit UserControl
        interface IDisposable
    end
The PreviewControl type exposes the following members.
Constructors
Name | Description
PreviewControl | Constructs a preview control.
Top
Properties
Name | Description
ActualHeight | Gets the rendered height of this element.
(Inherited from FrameworkElement)
ActualWidth | Gets the rendered width of this element.
(Inherited from FrameworkElement)
AllowDrop | Gets or sets a value indicating whether this element can be used as the target of a drag-and-drop operation. This is a dependency property.
(Inherited from UIElement)
AreAnyTouchesCaptured | Gets a value that indicates whether at least one touch is captured to this element.
(Inherited from UIElement)
AreAnyTouchesCapturedWithin | Gets a value that indicates whether at least one touch is captured to this element or to any child elements in its visual tree.
(Inherited from UIElement)
AreAnyTouchesDirectlyOver | Gets a value that indicates whether at least one touch is pressed over this element.
(Inherited from UIElement)
AreAnyTouchesOver | Gets a value that indicates whether at least one touch is pressed over this element or any child elements in its visual tree.
(Inherited from UIElement)
Background | Gets or sets a brush that describes the background of a control.
(Inherited from Control)
BindingGroup | Gets or sets the BindingGroup that is used for the element.
(Inherited from FrameworkElement)
BitmapEffect | Obsolete.
Gets or sets a bitmap effect that applies directly to the rendered content for this element. This is a dependency property.
(Inherited from UIElement)
BitmapEffectInput | Obsolete.
Gets or sets an input source for the bitmap effect that applies directly to the rendered content for this element. This is a dependency property.
(Inherited from UIElement)
BorderBrush | Gets or sets a brush that describes the border background of a control.
(Inherited from Control)
BorderThickness | Gets or sets the border thickness of a control.
(Inherited from Control)
CacheMode | Gets or sets a cached representation of the UIElement.
(Inherited from UIElement)
Clip | Gets or sets the geometry used to define the outline of the contents of an element. This is a dependency property.
(Inherited from UIElement)
ClipToBounds | Gets or sets a value indicating whether to clip the content of this element (or content coming from the child elements of this element) to fit into the size of the containing element. This is a dependency property.
(Inherited from UIElement)
CommandBindings | Gets a collection of CommandBinding objects associated with this element. A CommandBinding enables command handling for this element, and declares the linkage between a command, its events, and the handlers attached by this element.
(Inherited from UIElement)
Content | Gets or sets the content of a ContentControl.
(Inherited from ContentControl)
ContentStringFormat | Gets or sets a composite string that specifies how to format the Content property if it is displayed as a string.
(Inherited from ContentControl)
ContentTemplate | Gets or sets the data template used to display the content of the ContentControl.
(Inherited from ContentControl)
ContentTemplateSelector | Gets or sets a template selector that enables an application writer to provide custom template-selection logic.
(Inherited from ContentControl)
ContextMenu | Gets or sets the context menu element that should appear whenever the context menu is requested through user interface (UI) from within this element.
(Inherited from FrameworkElement)
Cursor | Gets or sets the cursor that displays when the mouse pointer is over this element.
(Inherited from FrameworkElement)
DataContext | Gets or sets the data context for an element when it participates in data binding.
(Inherited from FrameworkElement)
DependencyObjectType | Gets the DependencyObjectType that wraps the CLR type of this instance.
(Inherited from DependencyObject)
DesiredSize | Gets the size that this element computed during the measure pass of the layout process.
(Inherited from UIElement)
Dispatcher | Gets the Dispatcher this DispatcherObject is associated with.
(Inherited from DispatcherObject)
Effect | Gets or sets the bitmap effect to apply to the UIElement. This is a dependency property.
(Inherited from UIElement)
FlowDirection | Gets or sets the direction that text and other user interface (UI) elements flow within any parent element that controls their layout.
(Inherited from FrameworkElement)
Focusable | Gets or sets a value that indicates whether the element can receive focus. This is a dependency property.
(Inherited from UIElement)
FocusVisualStyle | Gets or sets a property that enables customization of appearance, effects, or other style characteristics that will apply to this element when it captures keyboard focus.
(Inherited from FrameworkElement)
FontFamily | Gets or sets the font family of the control.
(Inherited from Control)
FontSize | Gets or sets the font size.
(Inherited from Control)
FontStretch | Gets or sets the degree to which a font is condensed or expanded on the screen.
(Inherited from Control)
FontStyle | Gets or sets the font style.
(Inherited from Control)
FontWeight | Gets or sets the weight or thickness of the specified font.
(Inherited from Control)
ForceCursor | Gets or sets a value that indicates whether this FrameworkElement should force the user interface (UI) to render the cursor as declared by the Cursor property.
(Inherited from FrameworkElement)
Foreground | Gets or sets a brush that describes the foreground color.
(Inherited from Control)
HasAnimatedProperties | Gets a value indicating whether this element has any animated properties.
(Inherited from UIElement)
HasContent | Gets a value that indicates whether the ContentControl contains content.
(Inherited from ContentControl)
Height | Gets or sets the suggested height of the element.
(Inherited from FrameworkElement)
HorizontalAlignment | Gets or sets the horizontal alignment characteristics applied to this element when it is composed within a parent element, such as a panel or items control.
(Inherited from FrameworkElement)
HorizontalContentAlignment | Gets or sets the horizontal alignment of the control's content.
(Inherited from Control)
InputBindings | Gets the collection of input bindings associated with this element.
(Inherited from UIElement)
InputScope | Gets or sets the context for input used by this FrameworkElement.
(Inherited from FrameworkElement)
IsArrangeValid | Gets a value indicating whether the computed size and position of child elements in this element's layout are valid.
(Inherited from UIElement)
IsEnabled | Gets or sets a value indicating whether this element is enabled in the user interface (UI). This is a dependency property.
(Inherited from UIElement)
IsFocused | Gets a value that determines whether this element has logical focus. This is a dependency property.
(Inherited from UIElement)
IsHitTestVisible | Gets or sets a value that declares whether this element can possibly be returned as a hit test result from some portion of its rendered content. This is a dependency property.
(Inherited from UIElement)
IsInitialized | Gets a value that indicates whether this element has been initialized, either during processing by a XAML processor, or by explicitly having its EndInit() method called.
(Inherited from FrameworkElement)
IsInputMethodEnabled | Gets a value indicating whether an input method system, such as an Input Method Editor (IME), is enabled for processing the input to this element.
(Inherited from UIElement)
IsKeyboardFocused | Gets a value indicating whether this element has keyboard focus. This is a dependency property.
(Inherited from UIElement)
IsKeyboardFocusWithin | Gets a value indicating whether keyboard focus is anywhere within the element or its visual tree child elements. This is a dependency property.
(Inherited from UIElement)
IsLoaded | Gets a value that indicates whether this element has been loaded for presentation.
(Inherited from FrameworkElement)
IsManipulationEnabled | Gets or sets a value that indicates whether manipulation events are enabled on this UIElement.
(Inherited from UIElement)
IsMeasureValid | Gets a value indicating whether the current size returned by layout measure is valid.
(Inherited from UIElement)
IsMouseCaptured | Gets a value indicating whether the mouse is captured to this element. This is a dependency property.
(Inherited from UIElement)
IsMouseCaptureWithin | Gets a value that determines whether mouse capture is held by this element or by child elements in its visual tree. This is a dependency property.
(Inherited from UIElement)
IsMouseDirectlyOver | Gets a value that indicates whether the position of the mouse pointer corresponds to hit test results, which take element compositing into account. This is a dependency property.
(Inherited from UIElement)
IsMouseOver | Gets a value indicating whether the mouse pointer is located over this element (including child elements in the visual tree). This is a dependency property.
(Inherited from UIElement)
IsSealed | Gets a value that indicates whether this instance is currently sealed (read-only).
(Inherited from DependencyObject)
IsStylusCaptured | Gets a value indicating whether the stylus is captured by this element. This is a dependency property.
(Inherited from UIElement)
IsStylusCaptureWithin | Gets a value that determines whether stylus capture is held by this element, or an element within the element bounds and its visual tree. This is a dependency property.
(Inherited from UIElement)
IsStylusDirectlyOver | Gets a value that indicates whether the stylus position corresponds to hit test results, which take element compositing into account. This is a dependency property.
(Inherited from UIElement)
IsStylusOver | Gets a value indicating whether the stylus cursor is located over this element (including visual child elements). This is a dependency property.
(Inherited from UIElement)
IsTabStop | Gets or sets a value that indicates whether a control is included in tab navigation.
(Inherited from Control)
IsVisible | Gets a value indicating whether this element is visible in the user interface (UI). This is a dependency property.
(Inherited from UIElement)
Language | Gets or sets localization/globalization language information that applies to an element.
(Inherited from FrameworkElement)
LayoutTransform | Gets or sets a graphics transformation that should apply to this element when layout is performed.
(Inherited from FrameworkElement)
Margin | Gets or sets the outer margin of an element.
(Inherited from FrameworkElement)
MaxHeight | Gets or sets the maximum height constraint of the element.
(Inherited from FrameworkElement)
MaxWidth | Gets or sets the maximum width constraint of the element.
(Inherited from FrameworkElement)
MinHeight | Gets or sets the minimum height constraint of the element.
(Inherited from FrameworkElement)
MinWidth | Gets or sets the minimum width constraint of the element.
(Inherited from FrameworkElement)
Name | Gets or sets the identifying name of the element. The name provides a reference so that code-behind, such as event handler code, can refer to a markup element after it is constructed during processing by a XAML processor.
(Inherited from FrameworkElement)
Opacity | Gets or sets the opacity factor applied to the entire UIElement when it is rendered in the user interface (UI). This is a dependency property.
(Inherited from UIElement)
OpacityMask | Gets or sets an opacity mask, as a Brush implementation that is applied to any alpha-channel masking for the rendered content of this element. This is a dependency property.
(Inherited from UIElement)
OverridesDefaultStyle | Gets or sets a value that indicates whether this element incorporates style properties from theme styles.
(Inherited from FrameworkElement)
Padding | Gets or sets the padding inside a control.
(Inherited from Control)
Parent | Gets the logical parent element of this element.
(Inherited from FrameworkElement)
PersistId | Obsolete.
Gets a value that uniquely identifies this element.
(Inherited from UIElement)
RenderSize | Gets (or sets) the final render size of this element.
(Inherited from UIElement)
RenderTransform | Gets or sets transform information that affects the rendering position of this element. This is a dependency property.
(Inherited from UIElement)
RenderTransformOrigin | Gets or sets the center point of any possible render transform declared by RenderTransform, relative to the bounds of the element. This is a dependency property.
(Inherited from UIElement)
Resources | Gets or sets the locally-defined resource dictionary.
(Inherited from FrameworkElement)
ScrollbarVisibility |  The visibility of the preview view scrollbars.
SnapsToDevicePixels | Gets or sets a value that determines whether rendering for this element should use device-specific pixel settings during rendering. This is a dependency property.
(Inherited from UIElement)
Style | Gets or sets the style used by this element when it is rendered.
(Inherited from FrameworkElement)
TabIndex | Gets or sets a value that determines the order in which elements receive focus when the user navigates through controls by using the TAB key.
(Inherited from Control)
Tag | Gets or sets an arbitrary object value that can be used to store custom information about this element.
(Inherited from FrameworkElement)
Template | Gets or sets a control template.
(Inherited from Control)
TemplatedParent | Gets a reference to the template parent of this element. This property is not relevant if the element was not created through a template.
(Inherited from FrameworkElement)
ToolTip | Gets or sets the tool-tip object that is displayed for this element in the user interface (UI).
(Inherited from FrameworkElement)
TouchesCaptured | Gets all touch devices that are captured to this element.
(Inherited from UIElement)
TouchesCapturedWithin | Gets all touch devices that are captured to this element or any child elements in its visual tree.
(Inherited from UIElement)
TouchesDirectlyOver | Gets all touch devices that are over this element.
(Inherited from UIElement)
TouchesOver | Gets all touch devices that are over this element or any child elements in its visual tree.
(Inherited from UIElement)
Triggers | Gets the collection of triggers established directly on this element, or in child elements.
(Inherited from FrameworkElement)
Uid | Gets or sets the unique identifier (for localization) for this element. This is a dependency property.
(Inherited from UIElement)
UIView | The UI view representing the preview view.
UseLayoutRounding | Gets or sets a value that indicates whether layout rounding should be applied to this element's size and position during layout.
(Inherited from FrameworkElement)
VerticalAlignment | Gets or sets the vertical alignment characteristics applied to this element when it is composed within a parent element such as a panel or items control.
(Inherited from FrameworkElement)
VerticalContentAlignment | Gets or sets the vertical alignment of the control's content.
(Inherited from Control)
ViewId | The view Id.
Visibility | Gets or sets the user interface (UI) visibility of this element. This is a dependency property.
(Inherited from UIElement)
Width | Gets or sets the width of the element.
(Inherited from FrameworkElement)
Top
Methods
Name | Description
AddHandler(RoutedEvent, Delegate) | Adds a routed event handler for a specified routed event, adding the handler to the handler collection on the current element.
(Inherited from UIElement)
AddHandler(RoutedEvent, Delegate, Boolean) | Adds a routed event handler for a specified routed event, adding the handler to the handler collection on the current element. Specify handledEventsToo as true to have the provided handler be invoked for routed event that had already been marked as handled by another element along the event route.
(Inherited from UIElement)
AddToEventRoute | Adds handlers to the specified EventRoute for the current UIElement event handler collection.
(Inherited from UIElement)
ApplyAnimationClock(DependencyProperty, AnimationClock) | Applies an animation to a specified dependency property on this element. Any existing animations are stopped and replaced with the new animation.
(Inherited from UIElement)
ApplyAnimationClock(DependencyProperty, AnimationClock, HandoffBehavior) | Applies an animation to a specified dependency property on this element, with the ability to specify what happens if the property already has a running animation.
(Inherited from UIElement)
ApplyTemplate | Builds the current template's visual tree if necessary, and returns a value that indicates whether the visual tree was rebuilt by this call.
(Inherited from FrameworkElement)
Arrange | Positions child elements and determines a size for a UIElement. Parent elements call this method from their ArrangeCore(Rect) implementation (or a WPF framework-level equivalent) to form a recursive layout update. This method constitutes the second pass of a layout update.
(Inherited from UIElement)
BeginAnimation(DependencyProperty, AnimationTimeline) | Starts an animation for a specified animated property on this element.
(Inherited from UIElement)
BeginAnimation(DependencyProperty, AnimationTimeline, HandoffBehavior) | Starts a specific animation for a specified animated property on this element, with the option of specifying what happens if the property already has a running animation.
(Inherited from UIElement)
BeginInit | Starts the initialization process for this element.
(Inherited from FrameworkElement)
BeginStoryboard(Storyboard) | Begins the sequence of actions that are contained in the provided storyboard.
(Inherited from FrameworkElement)
BeginStoryboard(Storyboard, HandoffBehavior) | Begins the sequence of actions contained in the provided storyboard, with options specified for what should happen if the property is already animated.
(Inherited from FrameworkElement)
BeginStoryboard(Storyboard, HandoffBehavior, Boolean) | Begins the sequence of actions contained in the provided storyboard, with specified state for control of the animation after it is started.
(Inherited from FrameworkElement)
BringIntoView() | Attempts to bring this element into view, within any scrollable regions it is contained within.
(Inherited from FrameworkElement)
BringIntoView(Rect) | Attempts to bring the provided region size of this element into view, within any scrollable regions it is contained within.
(Inherited from FrameworkElement)
CaptureMouse | Attempts to force capture of the mouse to this element.
(Inherited from UIElement)
CaptureStylus | Attempts to force capture of the stylus to this element.
(Inherited from UIElement)
CaptureTouch | Attempts to force capture of a touch to this element.
(Inherited from UIElement)
CheckAccess | Determines whether the calling thread has access to this DispatcherObject.
(Inherited from DispatcherObject)
ClearValue(DependencyProperty) | Clears the local value of a property. The property to be cleared is specified by a DependencyProperty identifier.
(Inherited from DependencyObject)
ClearValue(DependencyPropertyKey) | Clears the local value of a read-only property. The property to be cleared is specified by a DependencyPropertyKey.
(Inherited from DependencyObject)
CoerceValue | Coerces the value of the specified dependency property. This is accomplished by invoking any CoerceValueCallback function specified in property metadata for the dependency property as it exists on the calling DependencyObject.
(Inherited from DependencyObject)
Dispose |  This method is called if the user explicitly disposes of the object (by calling the Dispose method in other managed languages, or the destructor in C++).
EndInit | Indicates that the initialization process for the element is complete.
(Inherited from FrameworkElement)
Equals | Determines whether a provided DependencyObject is equivalent to the current DependencyObject.
(Inherited from DependencyObject)
FindCommonVisualAncestor | Returns the common ancestor of two visual objects.
(Inherited from Visual)
FindName | Finds an element that has the provided identifier name.
(Inherited from FrameworkElement)
FindResource | Searches for a resource with the specified key, and throws an exception if the requested resource is not found.
(Inherited from FrameworkElement)
Focus | Attempts to set focus to this element.
(Inherited from UIElement)
GetAnimationBaseValue | Returns the base property value for the specified property on this element, disregarding any possible animated value from a running or stopped animation.
(Inherited from UIElement)
GetBindingExpression | Returns the BindingExpression that represents the binding on the specified property.
(Inherited from FrameworkElement)
GetHashCode | Gets a hash code for this DependencyObject.
(Inherited from DependencyObject)
GetLocalValueEnumerator | Creates a specialized enumerator for determining which dependency properties have locally set values on this DependencyObject.
(Inherited from DependencyObject)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetValue | Returns the current effective value of a dependency property on this instance of a DependencyObject.
(Inherited from DependencyObject)
InputHitTest | Returns the input element within the current element that is at the specified coordinates, relative to the current element's origin.
(Inherited from UIElement)
InvalidateArrange | Invalidates the arrange state (layout) for the element. After the invalidation, the element will have its layout updated, which will occur asynchronously unless subsequently forced by UpdateLayout().
(Inherited from UIElement)
InvalidateMeasure | Invalidates the measurement state (layout) for the element.
(Inherited from UIElement)
InvalidateProperty | Re-evaluates the effective value for the specified dependency property.
(Inherited from DependencyObject)
InvalidateVisual | Invalidates the rendering of the element, and forces a complete new layout pass. OnRender(DrawingContext) is called after the layout cycle is completed.
(Inherited from UIElement)
IsAncestorOf | Determines whether the visual object is an ancestor of the descendant visual object.
(Inherited from Visual)
IsDescendantOf | Determines whether the visual object is a descendant of the ancestor visual object.
(Inherited from Visual)
Measure | Updates the DesiredSize of a UIElement. Parent elements call this method from their own MeasureCore(Size) implementations to form a recursive layout update. Calling this method constitutes the first pass (the "Measure" pass) of a layout update.
(Inherited from UIElement)
MoveFocus | Moves the keyboard focus away from this element and to another element in a provided traversal direction.
(Inherited from FrameworkElement)
OnApplyTemplate | When overridden in a derived class, is invoked whenever application code or internal processes call ApplyTemplate().
(Inherited from FrameworkElement)
PointFromScreen | Converts a Point in screen coordinates into a Point that represents the current coordinate system of the Visual.
(Inherited from Visual)
PointToScreen | Converts a Point that represents the current coordinate system of the Visual into a Point in screen coordinates.
(Inherited from Visual)
PredictFocus | Determines the next element that would receive focus relative to this element for a provided focus movement direction, but does not actually move the focus.
(Inherited from FrameworkElement)
RaiseEvent | Raises a specific routed event. The RoutedEvent to be raised is identified within the RoutedEventArgs instance that is provided (as the RoutedEvent property of that event data).
(Inherited from UIElement)
ReadLocalValue | Returns the local value of a dependency property, if it exists.
(Inherited from DependencyObject)
RegisterName | Provides an accessor that simplifies access to the NameScope registration method.
(Inherited from FrameworkElement)
ReleaseAllTouchCaptures | Releases all captured touch devices from this element.
(Inherited from UIElement)
ReleaseMouseCapture | Releases the mouse capture, if this element held the capture.
(Inherited from UIElement)
ReleaseStylusCapture | Releases the stylus device capture, if this element held the capture.
(Inherited from UIElement)
ReleaseTouchCapture | Attempts to release the specified touch device from this element.
(Inherited from UIElement)
RemoveHandler | Removes the specified routed event handler from this element.
(Inherited from UIElement)
SetBinding(DependencyProperty, String) | Attaches a binding to this element, based on the provided source property name as a path qualification to the data source.
(Inherited from FrameworkElement)
SetBinding(DependencyProperty, BindingBase) | Attaches a binding to this element, based on the provided binding object.
(Inherited from FrameworkElement)
SetCurrentValue | Sets the value of a dependency property without changing its value source.
(Inherited from DependencyObject)
SetResourceReference | Searches for a resource with the specified name and sets up a resource reference to it for the specified property.
(Inherited from FrameworkElement)
SetValue(DependencyProperty, Object) | Sets the local value of a dependency property, specified by its dependency property identifier.
(Inherited from DependencyObject)
SetValue(DependencyPropertyKey, Object) | Sets the local value of a read-only dependency property, specified by the DependencyPropertyKey identifier of the dependency property.
(Inherited from DependencyObject)
ShouldSerializeCommandBindings | Returns whether serialization processes should serialize the contents of the CommandBindings property on instances of this class.
(Inherited from UIElement)
ShouldSerializeContent | Indicates whether the Content property should be persisted.
(Inherited from ContentControl)
ShouldSerializeInputBindings | Returns whether serialization processes should serialize the contents of the InputBindings property on instances of this class.
(Inherited from UIElement)
ShouldSerializeResources | Returns whether serialization processes should serialize the contents of the Resources property.
(Inherited from FrameworkElement)
ShouldSerializeStyle | Returns whether serialization processes should serialize the contents of the Style property.
(Inherited from FrameworkElement)
ShouldSerializeTriggers | Returns whether serialization processes should serialize the contents of the Triggers property.
(Inherited from FrameworkElement)
ToString | Returns the string representation of a Control object.
(Inherited from Control)
TransformToAncestor(Visual) | Returns a transform that can be used to transform coordinates from the Visual to the specified Visual ancestor of the visual object.
(Inherited from Visual)
TransformToAncestor(Visual3D) | Returns a transform that can be used to transform coordinates from the Visual to the specified Visual3D ancestor of the visual object.
(Inherited from Visual)
TransformToDescendant | Returns a transform that can be used to transform coordinates from the Visual to the specified visual object descendant.
(Inherited from Visual)
TransformToVisual | Returns a transform that can be used to transform coordinates from the Visual to the specified visual object.
(Inherited from Visual)
TranslatePoint | Translates a point relative to this element to coordinates that are relative to the specified element.
(Inherited from UIElement)
TryFindResource | Searches for a resource with the specified key, and returns that resource if found.
(Inherited from FrameworkElement)
UnregisterName | Simplifies access to the NameScope de-registration method.
(Inherited from FrameworkElement)
UpdateDefaultStyle | Reapplies the default style to the current FrameworkElement.
(Inherited from FrameworkElement)
UpdateLayout | Ensures that all visual child elements of this element are properly updated for layout.
(Inherited from UIElement)
VerifyAccess | Enforces that the calling thread has access to this DispatcherObject.
(Inherited from DispatcherObject)
Top
Events
Name | Description
ContextMenuClosing | Occurs just before any context menu on the element is closed.
(Inherited from FrameworkElement)
ContextMenuOpening | Occurs when any context menu on the element is opened.
(Inherited from FrameworkElement)
DataContextChanged | Occurs when the data context for this element changes.
(Inherited from FrameworkElement)
DragEnter | Occurs when the input system reports an underlying drag event with this element as the drag target.
(Inherited from UIElement)
DragLeave | Occurs when the input system reports an underlying drag event with this element as the drag origin.
(Inherited from UIElement)
DragOver | Occurs when the input system reports an underlying drag event with this element as the potential drop target.
(Inherited from UIElement)
Drop | Occurs when the input system reports an underlying drop event with this element as the drop target.
(Inherited from UIElement)
FocusableChanged | Occurs when the value of the Focusable property changes.
(Inherited from UIElement)
GiveFeedback | Occurs when the input system reports an underlying drag-and-drop event that involves this element.
(Inherited from UIElement)
GotFocus | Occurs when this element gets logical focus.
(Inherited from UIElement)
GotKeyboardFocus | Occurs when the keyboard is focused on this element.
(Inherited from UIElement)
GotMouseCapture | Occurs when this element captures the mouse.
(Inherited from UIElement)
GotStylusCapture | Occurs when this element captures the stylus.
(Inherited from UIElement)
GotTouchCapture | Occurs when a touch is captured to this element.
(Inherited from UIElement)
Initialized | Occurs when this FrameworkElement is initialized. This event coincides with cases where the value of the IsInitialized property changes from false (or undefined) to true.
(Inherited from FrameworkElement)
IsEnabledChanged | Occurs when the value of the IsEnabled property on this element changes.
(Inherited from UIElement)
IsHitTestVisibleChanged | Occurs when the value of the IsHitTestVisible dependency property changes on this element.
(Inherited from UIElement)
IsKeyboardFocusedChanged | Occurs when the value of the IsKeyboardFocused property changes on this element.
(Inherited from UIElement)
IsKeyboardFocusWithinChanged | Occurs when the value of the IsKeyboardFocusWithin property changes on this element.
(Inherited from UIElement)
IsMouseCapturedChanged | Occurs when the value of the IsMouseCaptured property changes on this element.
(Inherited from UIElement)
IsMouseCaptureWithinChanged | Occurs when the value of the IsMouseCaptureWithinProperty changes on this element.
(Inherited from UIElement)
IsMouseDirectlyOverChanged | Occurs when the value of the IsMouseDirectlyOver property changes on this element.
(Inherited from UIElement)
IsStylusCapturedChanged | Occurs when the value of the IsStylusCaptured property changes on this element.
(Inherited from UIElement)
IsStylusCaptureWithinChanged | Occurs when the value of the IsStylusCaptureWithin property changes on this element.
(Inherited from UIElement)
IsStylusDirectlyOverChanged | Occurs when the value of the IsStylusDirectlyOver property changes on this element.
(Inherited from UIElement)
IsVisibleChanged | Occurs when the value of the IsVisible property changes on this element.
(Inherited from UIElement)
KeyDown | Occurs when a key is pressed while focus is on this element.
(Inherited from UIElement)
KeyUp | Occurs when a key is released while focus is on this element.
(Inherited from UIElement)
LayoutUpdated | Occurs when the layout of the various visual elements associated with the current Dispatcher changes.
(Inherited from UIElement)
Loaded | Occurs when the element is laid out, rendered, and ready for interaction.
(Inherited from FrameworkElement)
LostFocus | Occurs when this element loses logical focus.
(Inherited from UIElement)
LostKeyboardFocus | Occurs when the keyboard is no longer focused on this element.
(Inherited from UIElement)
LostMouseCapture | Occurs when this element loses mouse capture.
(Inherited from UIElement)
LostStylusCapture | Occurs when this element loses stylus capture.
(Inherited from UIElement)
LostTouchCapture | Occurs when this element loses a touch capture.
(Inherited from UIElement)
ManipulationBoundaryFeedback | Occurs when the manipulation encounters a boundary.
(Inherited from UIElement)
ManipulationCompleted | Occurs when a manipulation and inertia on the UIElement object is complete.
(Inherited from UIElement)
ManipulationDelta | Occurs when the input device changes position during a manipulation.
(Inherited from UIElement)
ManipulationInertiaStarting | Occurs when the input device loses contact with the UIElement object during a manipulation and inertia begins.
(Inherited from UIElement)
ManipulationStarted | Occurs when an input device begins a manipulation on the UIElement object.
(Inherited from UIElement)
ManipulationStarting | Occurs when the manipulation processor is first created.
(Inherited from UIElement)
MouseDoubleClick | Occurs when a mouse button is clicked two or more times.
(Inherited from Control)
MouseDown | Occurs when any mouse button is pressed while the pointer is over this element.
(Inherited from UIElement)
MouseEnter | Occurs when the mouse pointer enters the bounds of this element.
(Inherited from UIElement)
MouseLeave | Occurs when the mouse pointer leaves the bounds of this element.
(Inherited from UIElement)
MouseLeftButtonDown | Occurs when the left mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
MouseLeftButtonUp | Occurs when the left mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
MouseMove | Occurs when the mouse pointer moves while over this element.
(Inherited from UIElement)
MouseRightButtonDown | Occurs when the right mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
MouseRightButtonUp | Occurs when the right mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
MouseUp | Occurs when any mouse button is released over this element.
(Inherited from UIElement)
MouseWheel | Occurs when the user rotates the mouse wheel while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewDragEnter | Occurs when the input system reports an underlying drag event with this element as the drag target.
(Inherited from UIElement)
PreviewDragLeave | Occurs when the input system reports an underlying drag event with this element as the drag origin.
(Inherited from UIElement)
PreviewDragOver | Occurs when the input system reports an underlying drag event with this element as the potential drop target.
(Inherited from UIElement)
PreviewDrop | Occurs when the input system reports an underlying drop event with this element as the drop target.
(Inherited from UIElement)
PreviewGiveFeedback | Occurs when a drag-and-drop operation is started.
(Inherited from UIElement)
PreviewGotKeyboardFocus | Occurs when the keyboard is focused on this element.
(Inherited from UIElement)
PreviewKeyDown | Occurs when a key is pressed while focus is on this element.
(Inherited from UIElement)
PreviewKeyUp | Occurs when a key is released while focus is on this element.
(Inherited from UIElement)
PreviewLostKeyboardFocus | Occurs when the keyboard is no longer focused on this element.
(Inherited from UIElement)
PreviewMouseDoubleClick | Occurs when a user clicks the mouse button two or more times.
(Inherited from Control)
PreviewMouseDown | Occurs when any mouse button is pressed while the pointer is over this element.
(Inherited from UIElement)
PreviewMouseLeftButtonDown | Occurs when the left mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseLeftButtonUp | Occurs when the left mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseMove | Occurs when the mouse pointer moves while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseRightButtonDown | Occurs when the right mouse button is pressed while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseRightButtonUp | Occurs when the right mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseUp | Occurs when any mouse button is released while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewMouseWheel | Occurs when the user rotates the mouse wheel while the mouse pointer is over this element.
(Inherited from UIElement)
PreviewQueryContinueDrag | Occurs when there is a change in the keyboard or mouse button state during a drag-and-drop operation.
(Inherited from UIElement)
PreviewStylusButtonDown | Occurs when the stylus button is pressed while the pointer is over this element.
(Inherited from UIElement)
PreviewStylusButtonUp | Occurs when the stylus button is released while the pointer is over this element.
(Inherited from UIElement)
PreviewStylusDown | Occurs when the stylus touches the digitizer while it is over this element.
(Inherited from UIElement)
PreviewStylusInAirMove | Occurs when the stylus moves over an element without actually touching the digitizer.
(Inherited from UIElement)
PreviewStylusInRange | Occurs when the stylus is close enough to the digitizer to be detected, while over this element.
(Inherited from UIElement)
PreviewStylusMove | Occurs when the stylus moves while over the element. The stylus must move while being detected by the digitizer to raise this event, otherwise, PreviewStylusInAirMove is raised instead.
(Inherited from UIElement)
PreviewStylusOutOfRange | Occurs when the stylus is too far from the digitizer to be detected.
(Inherited from UIElement)
PreviewStylusSystemGesture | Occurs when a user performs one of several stylus gestures.
(Inherited from UIElement)
PreviewStylusUp | Occurs when the user raises the stylus off the digitizer while the stylus is over this element.
(Inherited from UIElement)
PreviewTextInput | Occurs when this element gets text in a device-independent manner.
(Inherited from UIElement)
PreviewTouchDown | Occurs when a finger touches the screen while the finger is over this element.
(Inherited from UIElement)
PreviewTouchMove | Occurs when a finger moves on the screen while the finger is over this element.
(Inherited from UIElement)
PreviewTouchUp | Occurs when a finger is raised off of the screen while the finger is over this element.
(Inherited from UIElement)
QueryContinueDrag | Occurs when there is a change in the keyboard or mouse button state during a drag-and-drop operation.
(Inherited from UIElement)
QueryCursor | Occurs when the cursor is requested to display. This event is raised on an element each time that the mouse pointer moves to a new location, which means the cursor object might need to be changed based on its new position.
(Inherited from UIElement)
RequestBringIntoView | Occurs when BringIntoView(Rect) is called on this element.
(Inherited from FrameworkElement)
SizeChanged | Occurs when either the ActualHeight or the ActualWidth properties change value on this element.
(Inherited from FrameworkElement)
SourceUpdated | Occurs when the source value changes for any existing property binding on this element.
(Inherited from FrameworkElement)
StylusButtonDown | Occurs when the stylus button is pressed while the pointer is over this element.
(Inherited from UIElement)
StylusButtonUp | Occurs when the stylus button is released while the pointer is over this element.
(Inherited from UIElement)
StylusDown | Occurs when the stylus touches the digitizer while the stylus is over this element.
(Inherited from UIElement)
StylusEnter | Occurs when the stylus enters the bounds of this element.
(Inherited from UIElement)
StylusInAirMove | Occurs when the stylus moves over an element without actually touching the digitizer.
(Inherited from UIElement)
StylusInRange | Occurs when the stylus is close enough to the digitizer to be detected, while over this element.
(Inherited from UIElement)
StylusLeave | Occurs when the stylus leaves the bounds of the element.
(Inherited from UIElement)
StylusMove | Occurs when the stylus moves over this element. The stylus must move while on the digitizer to raise this event. Otherwise, StylusInAirMove is raised instead.
(Inherited from UIElement)
StylusOutOfRange | Occurs when the stylus is too far from the digitizer to be detected, while over this element.
(Inherited from UIElement)
StylusSystemGesture | Occurs when a user performs one of several stylus gestures.
(Inherited from UIElement)
StylusUp | Occurs when the user raises the stylus off the digitizer while it is over this element.
(Inherited from UIElement)
TargetUpdated | Occurs when the target value changes for any property binding on this element.
(Inherited from FrameworkElement)
TextInput | Occurs when this element gets text in a device-independent manner.
(Inherited from UIElement)
ToolTipClosing | Occurs just before any tooltip on the element is closed.
(Inherited from FrameworkElement)
ToolTipOpening | Occurs when any tooltip on the element is opened.
(Inherited from FrameworkElement)
TouchDown | Occurs when a finger touches the screen while the finger is over this element.
(Inherited from UIElement)
TouchEnter | Occurs when a touch moves from outside to inside the bounds of this element.
(Inherited from UIElement)
TouchLeave | Occurs when a touch moves from inside to outside the bounds of this element.
(Inherited from UIElement)
TouchMove | Occurs when a finger moves on the screen while the finger is over this element.
(Inherited from UIElement)
TouchUp | Occurs when a finger is raised off of the screen while the finger is over this element.
(Inherited from UIElement)
Unloaded | Occurs when the element is removed from within an element tree of loaded elements.
(Inherited from FrameworkElement)
Top
Remarks
 The dialog or form or window host this preview control must be modal. The view can be any graphical view but not a non-graphical view. And only one can be active. The view can be manipulated by embedded view cube and the visibility and graphical settings set on the view will be evident in the preview control.
See Also
Reference
Autodesk.Revit.UI Namespace